## Lab 4

In [1]:
!pip install psycopg2

Requirement already satisfied: psycopg2 in c:\programdata\anaconda3\lib\site-packages (2.8.3)

In [2]:
import pandas
import configparser
import psycopg2

In [3]:
config = configparser.ConfigParser()
config.read('config.ini')

host = config['myaws']['host']
user = config['myaws']['user']
password = config['myaws']['password']
database = config['myaws']['database']

In [4]:
conn = psycopg2.connect(
                       host = host,
                       user = user,
                       password = password,
                       dbname = database
)

In [5]:
cur = conn.cursor()

### Question 1

In [6]:
sql_statement = '''
                select * from student_gp5
                '''

In [7]:
df = pandas.read_sql_query(sql_statement,conn)
df [:]

,s_email,s_name,s_major
0,richargk@dukes.jmu.edu ...,Gabby Richardson ...,Intelligence Analysis ...
1,chandlex@dukes.jmu.edu ...,Erica Chandler ...,Intelligence Analysis ...
2,turnerfa@dukes.jmu.edu ...,Fiona Turner ...,Political Science ...
3,smithav@dukes.jmu.edu ...,Aubree Smith ...,Archaeology ...
4,addaebx@dukes.jmu.edu ...,Belinda Addae ...,Religion ...

### Question 2

In [8]:
sql_statement2 = '''
                select 
                c_name, count(s_email)
                from enroll_gp5
                
                group by c_name
                order by count(s_email) desc
                limit 1
                '''

In [9]:
df = pandas.read_sql_query(sql_statement2,conn)
df [:]

                                              c_name  count
0  IA 200                                        ...      2

### Question 3

In [10]:
sql_statement3 = '''
                select *
                from teacher_gp5
                inner join course_gp5
                on teacher_gp5.email = course_gp5.t_email
                '''

In [11]:
df = pandas.read_sql_query(sql_statement3,conn)
df [:]

,email,name,office,name,room,t_email
0,moore8ka@jmu.edu,Kathleen Moore ...,ISAT 116,IA 240 ...,EnGeo 1202,moore8ka@jmu.edu
1,hendrinx@jmu.edu,Noel Hendrickson ...,ISAT 300,IA 261 ...,ISAT 315,hendrinx@jmu.edu
2,taoqx@jmu.edu,Qingjiu Tao ...,EnGeo 2107,IA 210 ...,ISAT 125,taoqx@jmu.edu
3,hendrinx@jmu.edu,Noel Hendrickson ...,ISAT 300,IA 400 ...,EnGeo 360,hendrinx@jmu.edu
4,taude@jmu.edu,Finda Tuade ...,EnGeo 2017,IA 420 ...,EnGeo 360,taude@jmu.edu
5,taude@jmu.edu,Finda Tuade ...,EnGeo 2017,IA 200 ...,EnGeo 1204,taude@jmu.edu
6,adner@jmu.edu,Belna Adner ...,EnGeo 2020,IA 241 ...,EnGeo 2130,adner@jmu.edu

### Question 4

In [38]:
sql_statement4 = '''
                select teacher_gp5.name as t_name,
                count(course_gp5.name) as course_num
                from teacher_gp5
                inner join course_gp5
                on teacher_gp5.email = course_gp5.t_email
                group by teacher_gp5.name
                
                order by course_num desc
                limit 1
                '''

In [39]:
df = pandas.read_sql_query(sql_statement4,conn)
df [:]

                                              t_name  course_num
0  Finda Tuade                                   ...           2

### Question 5

In [14]:
sql_insert_statement = '''
                insert into teacher_gp5 (email,name,office)
                values('{}','{}','{}')
                '''.format('adner@jmu.edu','Belna Adner','EnGeo 2020')
print(sql_insert_statement)

                insert into teacher_gp5 (email,name,office)
                values('adner@jmu.edu','Belna Adner','EnGeo 2020')

In [15]:
# cur.execute(sql_insert_statement)

In [16]:
conn.commit()

In [17]:
df = pandas.read_sql_query("select * from teacher_gp5",conn)
df [:]

,email,name,office
0,moore8ka@jmu.edu,Kathleen Moore ...,ISAT 116
1,hendrinx@jmu.edu,Noel Hendrickson ...,ISAT 300
2,weixx@jmu.edu,Xuebin Wei ...,ISAT 112
3,taoqx@jmu.edu,Qingjiu Tao ...,EnGeo 2107
4,taude@jmu.edu,Finda Tuade ...,EnGeo 2017
5,adner@jmu.edu,Belna Adner ...,EnGeo 2020

In [18]:
sql_insert_statement = '''
                insert into course_gp5 (name,room,t_email)
                values('{}','{}','{}')
                '''.format('IA 420','EnGeo 3001','adner@jmu.edu')
print(sql_insert_statement)

                insert into course_gp5 (name,room,t_email)
                values('IA 420','EnGeo 3001','adner@jmu.edu')

In [19]:
# cur.execute(sql_insert_statement)

In [20]:
conn.commit()

In [21]:
df = pandas.read_sql_query("select * from teacher_gp5",conn)
df [:]

,email,name,office
0,moore8ka@jmu.edu,Kathleen Moore ...,ISAT 116
1,hendrinx@jmu.edu,Noel Hendrickson ...,ISAT 300
2,weixx@jmu.edu,Xuebin Wei ...,ISAT 112
3,taoqx@jmu.edu,Qingjiu Tao ...,EnGeo 2107
4,taude@jmu.edu,Finda Tuade ...,EnGeo 2017
5,adner@jmu.edu,Belna Adner ...,EnGeo 2020

### Question 6

In [24]:
sql_insert_statement = '''
                update course_gp5
                set t_email = '{}'
                where t_email = '{}'
                '''.format('adner@jmu.edu','weixx@jmu.edu')
print(sql_insert_statement)

                update course_gp5
                set t_email = 'adner@jmu.edu'
                where t_email = 'weixx@jmu.edu'

In [25]:
cur.execute(sql_insert_statement)

In [26]:
conn.commit()

In [27]:
df = pandas.read_sql_query("select * from course_gp5",conn)
df [:]

,name,room,t_email
0,IA 240 ...,EnGeo 1202,moore8ka@jmu.edu
1,IA 261 ...,ISAT 315,hendrinx@jmu.edu
2,IA 210 ...,ISAT 125,taoqx@jmu.edu
3,IA 400 ...,EnGeo 360,hendrinx@jmu.edu
4,IA 420 ...,EnGeo 360,taude@jmu.edu
5,IA 200 ...,EnGeo 1204,taude@jmu.edu
6,IA 241 ...,EnGeo 2130,adner@jmu.edu

#### Deleting Wei from teacher table

In [28]:
sql_insert_statement = '''
                delete from teacher_gp5.email
                where t_email = '{}'
                '''.format('weixx@jmu.edu')
print(sql_insert_statement)

                delete from teacher_gp5.email
                where t_email = 'weixx@jmu.edu'

In [40]:
#cur.execute(sql_insert_statement)

In [30]:
conn.commit()

In [31]:
df = pandas.read_sql_query("select * from course_gp5",conn)
df [:]

,name,room,t_email
0,IA 240 ...,EnGeo 1202,moore8ka@jmu.edu
1,IA 261 ...,ISAT 315,hendrinx@jmu.edu
2,IA 210 ...,ISAT 125,taoqx@jmu.edu
3,IA 400 ...,EnGeo 360,hendrinx@jmu.edu
4,IA 420 ...,EnGeo 360,taude@jmu.edu
5,IA 200 ...,EnGeo 1204,taude@jmu.edu
6,IA 241 ...,EnGeo 2130,adner@jmu.edu